InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/DMA/Peripheral/Register/xHeader/DMA_RegisterPeripheralChannel.h
/**
 *
 * @file DMA_RegisterPeripheralChannel.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 29 jul. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 29 jul. 2020     vyldram    1.0         initial Version@endverbatim
 */

#ifndef XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERPERIPHERALCHANNEL_H_
#define XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERPERIPHERALCHANNEL_H_

#include <xDriver_MCU/DMA/Peripheral/Register/xHeader/DMA_RegisterAddressChannel.h>
#include <xDriver_MCU/DMA/Peripheral/Struct/xHeader/DMA_StructPeripheralChannel.h>

#define DMA_CH_PRIMARY    ((DMA_CH_t*) (DMA_CH_PRIMARY_BASE))
#define DMA_CH_ALTERNATE    ((DMA_CH_t*) (DMA_CH_ALTERNATE_BASE))

/********************************************************************************************
************************************** 1 SRCENDP **********************************************
********************************************************************************************/
#define DMA_CH0_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH0_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH1_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH1_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH2_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH2_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH3_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH3_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH4_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH4_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH5_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH5_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH6_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH6_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH7_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH7_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH8_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH8_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH9_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH9_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH10_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH10_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH11_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH11_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH12_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH12_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH13_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH13_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH14_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH14_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH15_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH15_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH16_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH16_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH17_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH17_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH18_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH18_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH19_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH19_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH20_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH20_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH21_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH21_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH22_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH22_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH23_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH23_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH24_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH24_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH25_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH25_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH26_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH26_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH27_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH27_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH28_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH28_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH29_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH29_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH30_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH30_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH31_PRIMARY_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH31_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET))

#define DMA_CH0_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH0_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH1_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH1_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH2_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH2_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH3_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH3_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH4_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH4_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH5_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH5_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH6_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH6_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH7_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH7_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH8_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH8_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH9_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH9_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH10_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH10_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH11_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH11_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH12_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH12_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH13_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH13_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH14_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH14_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH15_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH15_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH16_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH16_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH17_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH17_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH18_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH18_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH19_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH19_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH20_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH20_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH21_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH21_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH22_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH22_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH23_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH23_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH24_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH24_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH25_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH25_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH26_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH26_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH27_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH27_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH28_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH28_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH29_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH29_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH30_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH30_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH31_PRIMARY_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH31_PRIMARY_BASE + DMA_CH_SRCENDP_OFFSET)))

/********************************************************************************************
************************************** ALT 1 SRCENDP **********************************************
********************************************************************************************/
#define DMA_CH0_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH0_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH1_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH1_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH2_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH2_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH3_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH3_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH4_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH4_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH5_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH5_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH6_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH6_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH7_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH7_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH8_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH8_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH9_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH9_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH10_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH10_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH11_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH11_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH12_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH12_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH13_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH13_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH14_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH14_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH15_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH15_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH16_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH16_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH17_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH17_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH18_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH18_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH19_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH19_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH20_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH20_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH21_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH21_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH22_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH22_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH23_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH23_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH24_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH24_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH25_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH25_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH26_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH26_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH27_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH27_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH28_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH28_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH29_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH29_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH30_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH30_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))
#define DMA_CH31_ALTERNATE_SRCENDP    ((DMA_CH_SRCENDP_t*) (DMA_CH31_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET))

#define DMA_CH0_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH0_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH1_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH1_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH2_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH2_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH3_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH3_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH4_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH4_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH5_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH5_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH6_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH6_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH7_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH7_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH8_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH8_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH9_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH9_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH10_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH10_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH11_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH11_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH12_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH12_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH13_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH13_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH14_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH14_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH15_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH15_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH16_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH16_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH17_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH17_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH18_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH18_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH19_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH19_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH20_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH20_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH21_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH21_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH22_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH22_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH23_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH23_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH24_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH24_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH25_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH25_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH26_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH26_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH27_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH27_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH28_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH28_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH29_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH29_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH30_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH30_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))
#define DMA_CH31_ALTERNATE_SRCENDP_R    (*((volatile UBase_t*) (DMA_CH31_ALTERNATE_BASE + DMA_CH_SRCENDP_OFFSET)))

/********************************************************************************************
************************************** 2 DSTENDP **********************************************
********************************************************************************************/
#define DMA_CH0_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH0_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH1_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH1_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH2_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH2_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH3_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH3_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH4_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH4_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH5_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH5_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH6_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH6_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH7_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH7_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH8_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH8_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH9_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH9_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH10_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH10_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH11_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH11_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH12_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH12_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH13_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH13_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH14_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH14_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH15_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH15_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH16_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH16_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH17_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH17_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH18_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH18_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH19_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH19_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH20_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH20_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH21_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH21_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH22_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH22_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH23_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH23_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH24_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH24_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH25_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH25_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH26_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH26_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH27_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH27_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH28_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH28_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH29_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH29_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH30_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH30_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH31_PRIMARY_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH31_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET))

#define DMA_CH0_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH0_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH1_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH1_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH2_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH2_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH3_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH3_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH4_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH4_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH5_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH5_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH6_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH6_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH7_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH7_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH8_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH8_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH9_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH9_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH10_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH10_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH11_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH11_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH12_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH12_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH13_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH13_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH14_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH14_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH15_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH15_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH16_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH16_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH17_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH17_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH18_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH18_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH19_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH19_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH20_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH20_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH21_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH21_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH22_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH22_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH23_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH23_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH24_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH24_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH25_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH25_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH26_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH26_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH27_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH27_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH28_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH28_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH29_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH29_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH30_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH30_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH31_PRIMARY_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH31_PRIMARY_BASE + DMA_CH_DSTENDP_OFFSET)))

