InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/DMA/Peripheral/Register/xHeader/DMA_RegisterPeripheralChannel.h
/********************************************************************************************
************************************** ALT 2 DSTENDP **********************************************
********************************************************************************************/
#define DMA_CH0_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH0_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH1_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH1_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH2_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH2_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH3_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH3_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH4_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH4_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH5_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH5_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH6_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH6_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH7_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH7_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH8_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH8_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH9_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH9_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH10_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH10_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH11_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH11_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH12_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH12_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH13_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH13_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH14_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH14_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH15_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH15_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH16_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH16_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH17_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH17_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH18_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH18_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH19_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH19_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH20_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH20_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH21_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH21_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH22_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH22_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH23_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH23_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH24_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH24_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH25_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH25_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH26_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH26_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH27_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH27_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH28_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH28_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH29_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH29_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH30_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH30_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))
#define DMA_CH31_ALTERNATE_DSTENDP    ((DMA_CH_DSTENDP_t*) (DMA_CH31_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET))

#define DMA_CH0_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH0_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH1_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH1_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH2_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH2_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH3_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH3_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH4_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH4_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH5_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH5_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH6_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH6_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH7_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH7_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH8_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH8_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH9_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH9_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH10_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH10_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH11_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH11_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH12_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH12_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH13_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH13_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH14_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH14_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH15_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH15_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH16_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH16_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH17_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH17_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH18_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH18_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH19_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH19_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH20_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH20_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH21_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH21_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH22_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH22_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH23_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH23_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH24_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH24_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH25_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH25_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH26_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH26_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH27_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH27_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH28_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH28_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH29_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH29_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH30_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH30_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))
#define DMA_CH31_ALTERNATE_DSTENDP_R    (*((volatile UBase_t*) (DMA_CH31_ALTERNATE_BASE + DMA_CH_DSTENDP_OFFSET)))

/********************************************************************************************
************************************** 3 CTL **********************************************
********************************************************************************************/
#define DMA_CH0_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH0_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH1_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH1_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH2_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH2_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH3_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH3_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH4_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH4_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH5_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH5_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH6_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH6_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH7_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH7_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH8_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH8_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH9_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH9_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH10_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH10_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH11_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH11_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH12_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH12_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH13_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH13_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH14_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH14_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH15_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH15_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH16_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH16_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH17_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH17_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH18_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH18_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH19_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH19_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH20_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH20_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH21_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH21_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH22_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH22_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH23_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH23_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH24_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH24_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH25_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH25_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH26_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH26_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH27_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH27_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH28_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH28_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH29_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH29_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH30_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH30_PRIMARY_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH31_PRIMARY_CTL    ((DMA_CH_CTL_t*) (DMA_CH31_PRIMARY_BASE + DMA_CH_CTL_OFFSET))

#define DMA_CH0_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH0_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH1_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH1_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH2_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH2_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH3_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH3_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH4_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH4_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH5_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH5_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH6_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH6_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH7_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH7_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH8_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH8_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH9_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH9_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH10_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH10_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH11_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH11_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH12_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH12_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH13_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH13_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH14_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH14_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH15_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH15_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH16_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH16_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH17_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH17_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH18_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH18_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH19_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH19_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH20_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH20_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH21_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH21_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH22_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH22_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH23_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH23_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH24_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH24_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH25_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH25_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH26_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH26_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH27_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH27_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH28_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH28_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH29_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH29_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH30_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH30_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH31_PRIMARY_CTL_R    (*((volatile UBase_t*) (DMA_CH31_PRIMARY_BASE + DMA_CH_CTL_OFFSET)))

/********************************************************************************************
************************************** ALT 3 CTL **********************************************
********************************************************************************************/
#define DMA_CH0_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH0_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH1_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH1_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH2_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH2_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH3_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH3_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH4_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH4_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH5_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH5_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH6_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH6_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH7_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH7_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH8_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH8_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH9_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH9_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH10_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH10_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH11_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH11_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH12_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH12_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH13_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH13_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH14_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH14_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH15_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH15_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH16_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH16_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH17_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH17_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH18_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH18_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH19_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH19_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH20_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH20_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH21_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH21_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH22_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH22_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH23_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH23_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH24_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH24_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH25_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH25_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH26_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH26_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH27_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH27_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH28_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH28_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH29_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH29_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH30_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH30_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))
#define DMA_CH31_ALTERNATE_CTL    ((DMA_CH_CTL_t*) (DMA_CH31_ALTERNATE_BASE + DMA_CH_CTL_OFFSET))

#define DMA_CH0_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH0_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH1_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH1_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH2_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH2_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH3_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH3_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH4_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH4_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH5_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH5_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH6_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH6_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH7_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH7_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH8_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH8_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH9_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH9_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH10_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH10_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH11_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH11_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH12_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH12_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH13_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH13_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH14_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH14_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH15_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH15_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH16_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH16_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH17_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH17_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH18_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH18_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH19_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH19_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH20_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH20_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH21_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH21_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH22_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH22_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH23_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH23_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH24_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH24_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH25_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH25_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH26_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH26_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH27_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH27_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH28_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH28_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH29_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH29_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH30_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH30_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))
#define DMA_CH31_ALTERNATE_CTL_R    (*((volatile UBase_t*) (DMA_CH31_ALTERNATE_BASE + DMA_CH_CTL_OFFSET)))

uintptr_t DMA_CH_Primary__uptrBlockBaseAddress(DMA_nMODULE enModuleArg);
uintptr_t DMA_CH_Alternate__uptrBlockBaseAddress(DMA_nMODULE enModuleArg);
uintptr_t DMA_CH__uptrBlockBaseAddress(DMA_nMODULE enModuleArg, DMA_nCH_CONTROL enControlArg);

#endif /* XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERPERIPHERALCHANNEL_H_ */
